app/controllers/prijava_controller.rb

  def newsession
    user=User.find_by(username: params[:username].downcase, password: params[:password])
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'janez' AND `users`.`password` = 'xxx' LIMIT 1