app/controllers/zahtevki_controller.rb

  def uredi
    if !current_user
      redirect_to(prijava_path)
    end

    if session[:level] == 2 or session[:level] == 3
      @tickets = Ticket.all
---
SELECT `tickets`.* FROM `tickets` WHERE (id = '3') ORDER BY `tickets`.`id` ASC LIMIT 1

  def pregled
    if !current_user
        redirect_to(prijava_path)
    end

    if session[:level] == 2 or session[:level] == 3
      @tickets = Ticket.all
    else
      @tickets = Ticket.find_all_by_user_id(session[:user_id])
---
SELECT `tickets`.* FROM `tickets`
SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`user_id` IS NULL

  def izbrisi
    @ticket_num=params[:id]
    Ticket.find(@ticket_num).destroy
---
DELETE FROM `tickets` WHERE `tickets`.`id` = 1
SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 1 LIMIT 1