app/controllers/zahtevki_controller.rb

  def uredi
    if !current_user
      redirect_to(prijava_path)
    end

    if session[:level] == 2 or session[:level] == 3
      #@tickets = Ticket.all
      @tickets = Ticket.where(["level = ?", session[:level]])
    else
      @tickets = Ticket.find_all_by_user_id(session[:user_id])
    end
    @edited_ticket = Ticket.where(["id = ?", params[:id]]).first
    @ticket_user = User.where(["id = ?", @edited_ticket.user_id]).first
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1